<?
// 휴일 처리
if ($year_cal=="2013"){
	$holiday_array = array //2013년 휴일
	(
	"1"=>array("1"=>"신정", "9"=>"구정", "10"=>"구정", "11"=>"구정"),
	"2"=>array(),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "17"=>"석가탄신일"),
	"6"=>array("6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("18"=>"추석", "19"=>"추석", "20"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
}else if($year_cal=="2014"){
	$holiday_array = array //2014년 휴일
	(
	"1"=>array("1"=>"신정", "30"=>"구정", "31"=>"구정"),
	"2"=>array("1"=>"구정"),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "6"=>"석가탄신일"),
	"6"=>array("4"=>"지방선거","6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("7"=>"추석", "8"=>"추석", "9"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
}else if($year_cal=="2015"){
	$holiday_array = array //2014년 휴일
	(
	"1"=>array("1"=>"신정", "30"=>"구정", "31"=>"구정"),
	"2"=>array("1"=>"구정"),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "6"=>"석가탄신일"),
	"6"=>array("6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("7"=>"추석", "8"=>"추석", "9"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
}

// 휴일 처리
	$holidays_array["2013"] = array //2013년 휴일
	(
	"1"=>array("1"=>"신정", "9"=>"구정", "10"=>"구정", "11"=>"구정"),
	"2"=>array(),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "17"=>"석가탄신일"),
	"6"=>array("6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("18"=>"추석", "19"=>"추석", "20"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
	$holidays_array["2014"] = array //2014년 휴일
	(
	"1"=>array("1"=>"신정", "30"=>"구정", "31"=>"구정"),
	"2"=>array("1"=>"구정"),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "6"=>"석가탄신일"),
	"6"=>array("4"=>"지방선거","6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("7"=>"추석", "8"=>"추석", "9"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
	$holidays_array["2015"] = array //2014년 휴일
	(
	"1"=>array("1"=>"신정", "30"=>"구정", "31"=>"구정"),
	"2"=>array("1"=>"구정"),
	"3"=>array("1"=>"삼일절"),
	"5"=>array("5"=>"어린이날", "17"=>"석가탄신일"),
	"6"=>array("6"=>"현충일"),
	"7"=>array(),
	"8"=>array("15"=>"광복절"),
	"9"=>array("7"=>"추석", "8"=>"추석", "9"=>"추석"),
	"10"=>array("3"=>"개천절","9"=>"한글날"),
	"11"=>array(),
	"12"=>array("25"=>"성탄절")
	);
?>